# -*- coding: UTF-8 -*-

agent_staff_agent_label_k = """
    # 背景
    叫叫英语是一个儿童英语学习平台，是一款专为学龄前儿童、小学青少年打造的儿童在线互动学习产品。
    叫叫英语的老师会与家长进行学情交流、产品介绍、报课沟通等。

    # 角色
    你现在是一个专业的对话内容分析专家，专门负责分析家长需求。
    我将给出一段老师和家长的对话，你需要根据给出的问题解释，分析出以下问题的选项：

            - 【单选问题】：【家长是孩子的哪位家属】
            - 【单选选项】：【妈妈】、【爸爸】、【爷爷】、【奶奶】、【姥姥】、【姥爷】、【其他】、【未提及】

            - 【单选问题】：【孩子是否接触过英语】
            - 【单选选项】：【接触过】、【未接触过】、【未提及】

            - 【单选问题】：【孩子是否零基础】
            - 【单选选项】：【零基础】、【有基础】、【未提及】

            - 【单选问题】：【孩子是否喜欢学英语】
            - 【单选选项】：【喜欢】、【不喜欢】、【未提及】

            - 【单选问题】：【是否掌握26个字母】
            - 【单选选项】：【已掌握】、【未掌握】、【部分掌握】、【未提及】

            - 【单选问题】：【学校几年级开始教英语】
            - 【单选选项】：【一年级】、【三年级】、【未提及】

            - 【多选问题】：【接触英语的途径】
            - 【多选选项】：【斑马】、【叽里呱啦】、【伴鱼】、【线下机构】、【幼儿园】、【小学】、【家长自己教】、【请家教】、【自学】、【其他】、【未提及】

            - 【多选问题】：【领课目标】
            - 【多选选项】：【培养兴趣】、【英语启蒙】、【对比竞品】、【了解体验】、【提升基础】、【其他】、【未提及】

            - 【多选问题】：【希望提升的英语能力】
            - 【多选选项】：【字母】、【词汇量】、【自然拼读】、【口语表达】、【音标】、【听说读写】、【其他】、【未提及】


    # 任务步骤
    我将输入一段家长和老师的对话，请根据以下指引帮我完成工作：
    一、依据对话内容逐个问题分析并选择正确的选项，只能从我给出的选项中选择，不得发散；    
    二、对于每一个问题，你都需要分析并输出【老师是否询问】该问题，只能选择【是】或【否】。
    三、对于每一个问题，你也需要分析并输出【家长是否回应】该问题，只能选择【是】或【否】。

    # 输出示例
    你将输出一个JSON对象，格式如下：
        [
            {
                "单选问题":"家长是孩子的哪位家属",
                "单选选项":"选项x",
                "老师是否询问":"是或否",
                "家长是否回应":"是或否"
            },
            {
                "单选问题":"孩子是否接触过英语",
                "单选选项":"选项x",
                "老师是否询问":"是或否",
                "家长是否回应":"是或否"
            },
            {
                "单选问题":"孩子是否零基础",
                "单选选项":"选项x",
                "老师是否询问":"是或否",
                "家长是否回应":"是或否"
            },
            {
                "单选问题":"孩子是否喜欢学英语",
                "单选选项":"选项x",
                "老师是否询问":"是或否",
                "家长是否回应":"是或否"
            },
            {
                "单选问题":"是否掌握26个字母",
                "单选选项":"选项x",
                "老师是否询问":"是或否",
                "家长是否回应":"是或否"
            },
            {
                "单选问题":"学校几年级开始教英语",
                "单选选项":"选项x",
                "老师是否询问":"是或否",
                "家长是否回应":"是或否"
            },
            {
                "多选问题":"接触英语的途径",
                "多选选项":"选项x、选项y、...",
                "老师是否询问":"是或否",
                "家长是否回应":"是或否"
            },
            {
                "多选问题":"领课目标",
                "多选选项":"选项x、选项y、...",
                "老师是否询问":"是或否",
                "家长是否回应":"是或否"
            },
            {
                "多选问题":"希望提升的英语能力",
                "多选选项":"选项x、选项y、...",
                "老师是否询问":"是或否",
                "家长是否回应":"是或否"
            }
        ]

    # 注意：
    一、单选问题只得选择一个正确选项；
    二、多选问题可以选择多个正确选项，选项之间用"、"分隔；
    三、你只能返回要求的JSON对象格式，不得输出任何多余内容；

"""
agent_staff_agent_label_k_samples = [
    {"role": "user", "content": """
老师：宝贝家长您好，为了让小朋友有更好的体验，在开始2月20号的英语学习前想问一问咱们宝贝之前有接触过英语的学习吗？❤

老师：小朋友几年级了呀家长

家长：二年级了

家长：没接触过，平时他爸爸也忙。

老师：好的，没关系哈~ 宝贝家长这次是出于什么考虑让宝贝体验咱们这个课程呢？
是想提升一下孩子的兴趣？给宝贝开始一下英语的启蒙？还是说只是先了解了解呀？还是基础提升，听说读写提升？

家长：都有吧

老师：您好家长，结合着宝贝现在2年级、0基础的情况给您几点建议，您可以作为从现在开始到9月份3年级的一个规划上的参考

老师：您可能也听说了哈，现在三年级新课改版以后的教材呢是全英文的教材，上来直接学句子。如果说宝贝没有一定的启蒙基础的情况下，可能确实一上来呃很打击孩子的这个学习积极性，对吧？对，给您几点，建议您也可以作为规划上的一个参考啊。

老师：第一点呢就是给宝贝做一个英语启蒙，让宝贝对英语有一个起码的一个认识。不至于说刚学习的时候他发音不标准，或者说说不出来，他感觉特别着急。对，包括咱们家长也是哈，有家长可能也会着急，这样是肯定是不对的哈。二、一个呢是引导宝贝对英语的一个学习兴趣，兴趣非常重要哈，家长持续性非常重要，比原来的科目，但是要长期的一个沉淀。第三个呢就是培养孩子的一个学习习惯。

    """},
    {"role": "assistant", "content": """[
    {
        "单选问题": "家长是孩子的哪位家属",
        "单选选项": "未提及",
        "老师是否询问":"否",
        "家长是否回应":"否"
    },
    {
        "单选问题": "孩子是否接触过英语",
        "单选选项": "未接触过",
        "老师是否询问":"是",
        "家长是否回应":"是"
    },
    {
        "单选问题": "孩子是否零基础",
        "单选选项": "未提及",
        "老师是否询问":"否",
        "家长是否回应":"否"
    },
    {
        "单选问题": "孩子是否喜欢学英语",
        "单选选项": "未提及",
        "老师是否询问":"否",
        "家长是否回应":"否"
    },
    {
        "单选问题": "是否掌握26个字母",
        "单选选项": "未提及",
        "老师是否询问":"否",
        "家长是否回应":"否"
    },
    {
        "单选问题": "学校几年级开始教英语",
        "单选选项": "未提及",
        "老师是否询问":"否",
        "家长是否回应":"否"
    },
    {
        "多选问题": "接触英语的途径",
        "多选选项": "未提及",
        "老师是否询问":"否",
        "家长是否回应":"否"
    },
    {
        "多选问题": "领课目标",
        "多选选项": "培养兴趣、英语启蒙、了解体验、提升基础",
        "老师是否询问":"是",
        "家长是否回应":"是"
    },
    {
        "多选问题": "希望提升的英语能力",
        "多选选项": "听说读写",
        "老师是否询问":"是",
        "家长是否回应":"是"
    }
]
    """},

    {"role": "user", "content": """
家长：还可以，挺感兴趣的

    """},
    {"role": "assistant", "content": """[
    {
        "单选问题": "家长是孩子的哪位家属",
        "单选选项": "未提及",
        "老师是否询问":"否",
        "家长是否回应":"否"
    },
    {
        "单选问题": "孩子是否接触过英语",
        "单选选项": "未提及",
        "老师是否询问":"否",
        "家长是否回应":"否"
    },
    {
        "单选问题": "孩子是否零基础",
        "单选选项": "未提及",
        "老师是否询问":"否",
        "家长是否回应":"否"
    },
    {
        "单选问题": "孩子是否喜欢学英语",
        "单选选项": "喜欢",
        "老师是否询问":"否",
        "家长是否回应":"是"
    },
    {
        "单选问题": "是否掌握26个字母",
        "单选选项": "未提及",
        "老师是否询问":"否",
        "家长是否回应":"否"
    },
    {
        "单选问题": "学校几年级开始教英语",
        "单选选项": "未提及",
        "老师是否询问":"否",
        "家长是否回应":"否"
    },
    {
        "多选问题": "接触英语的途径",
        "多选选项": "未提及",
        "老师是否询问":"否",
        "家长是否回应":"否"
    },
    {
        "多选问题": "领课目标",
        "多选选项": "未提及",
        "老师是否询问":"否",
        "家长是否回应":"否"
    },
    {
        "多选问题": "希望提升的英语能力",
        "多选选项": "未提及",
        "老师是否询问":"否",
        "家长是否回应":"否"
    }
]
    """},

]

invalid_sessions_reply = """[
    {
        "单选问题": "家长是孩子的哪位家属",
        "单选选项": "未提及",
        "老师是否询问":"否",
        "家长是否回应":"否"
    },
    {
        "单选问题": "孩子是否接触过英语",
        "单选选项": "未提及",
        "老师是否询问":"否",
        "家长是否回应":"否"
    },
    {
        "单选问题": "孩子是否零基础",
        "单选选项": "未提及",
        "老师是否询问":"否",
        "家长是否回应":"否"
    },
    {
        "单选问题": "孩子是否喜欢学英语",
        "单选选项": "未提及",
        "老师是否询问":"否",
        "家长是否回应":"否"
    },
    {
        "单选问题": "是否掌握26个字母",
        "单选选项": "未提及",
        "老师是否询问":"否",
        "家长是否回应":"否"
    },
    {
        "单选问题": "学校几年级开始教英语",
        "单选选项": "未提及",
        "老师是否询问":"否",
        "家长是否回应":"否"
    },
    {
        "多选问题": "接触英语的途径",
        "多选选项": "未提及",
        "老师是否询问":"否",
        "家长是否回应":"否"
    },
    {
        "多选问题": "领课目标",
        "多选选项": "未提及",
        "老师是否询问":"否",
        "家长是否回应":"否"
    },
    {
        "多选问题": "希望提升的英语能力",
        "多选选项": "未提及",
        "老师是否询问":"否",
        "家长是否回应":"否"
    }
]
    """